app/views/types/_type.json.jbuilder

SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT 1  [["uid", "alice@bbunch.org"]]
---
json.url type_url(type, format: :json)
json.user_roles type.user_roles     unless type.user_roles.empty?