app/controllers/thing_images_controller.rb

INSERT INTO "thing_images" ("thing_id", "image_id", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["thing_id", 7], ["image_id", 4], ["creator_id", 3], ["created_at", "2019-08-13 21:37:31.001207"], ["updated_at", "2019-08-13 21:37:31.001207"]]
---
  def create
    thing_image = ThingImage.new(thing_image_create_params.merge({
                                  :image_id=>params[:image_id],
                                  :thing_id=>params[:thing_id],
                                  }))
    thing=Thing.where(id:thing_image.thing_id).first
    if !thing
      full_message_error "cannot find thing[#{params[:thing_id]}]", :bad_request
      skip_authorization
    elsif !Image.where(id:thing_image.image_id).exists?
      full_message_error "cannot find image[#{params[:image_id]}]", :bad_request
      skip_authorization
    else
      authorize thing, :add_image?
      thing_image.creator_id=current_user.id
      if thing_image.save