app/controllers/things_controller.rb

  def create
    authorize Thing
    @thing = Thing.new(thing_params)

    User.transaction do
      if @thing.save
        role=current_user.add_role(Role::ORGANIZER,@thing)
        @thing.user_roles << role.role_name
        role.save!
---
INSERT INTO "things" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Gorgeous Granite Wallet"], ["created_at", "2019-07-28 23:22:34.009306"], ["updated_at", "2019-07-28 23:22:34.009306"]]
INSERT INTO "roles" ("role_name", "mname", "mid", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["role_name", "organizer"], ["mname", "Thing"], ["mid", 1], ["user_id", 1], ["created_at", "2019-07-28 23:22:29.853786"], ["updated_at", "2019-07-28 23:22:29.853786"]]
UPDATE "users" SET "tokens" = $1, "updated_at" = $2 WHERE "users"."id" = $3