app/controllers/thing_types_controller.rb

    def linkable_things
      authorize Thing, :get_linkables?
      type = Type.find(params[:type_id])
---
SELECT  "types".* FROM "types" WHERE "types"."id" = $1 LIMIT 1  [["id", 5]]

    def create
      thing_type = ThingType.new(thing_type_create_params.merge({
                                    :type_id=>params[:type_id],
                                    :thing_id=>params[:thing_id],
                                    }))
      thing=Thing.where(id:thing_type.thing_id).first
      if !thing
        full_message_error "cannot find thing[#{params[:thing_id]}]", :bad_request
        skip_authorization
      elsif !Type.where(id:thing_type.type_id).exists?
        full_message_error "cannot find type[#{params[:type_id]}]", :bad_request
        skip_authorization
      else
        authorize thing, :add_type?
        thing_type.creator_id=current_user.id
        if thing_type.save
---
SELECT  "things".* FROM "things" WHERE "things"."id" = $1  ORDER BY "things"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "types".* FROM "types" WHERE "types"."id" = $1 LIMIT 1  [["id", 13]]
SELECT  1 AS one FROM "types" WHERE "types"."id" = $1 LIMIT 1  [["id", 13]]
INSERT INTO "thing_types" ("thing_id", "type_id", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["thing_id", 1], ["type_id", 13], ["creator_id", 3], ["created_at", "2019-08-16 22:51:05.974980"], ["updated_at", "2019-08-16 22:51:05.974980"]]
UPDATE "users" SET "tokens" = $1, "updated_at" = $2 WHERE "users"."id" = $3