app/controllers/things_controller.rb

  def show
    # byebug
    authorize @thing
    things = ThingPolicy::Scope.new(current_user,
                                    Thing.where(:id=>@thing.id))
                                    .user_roles(false)
---
SELECT  "things".* FROM "things" WHERE "things"."id" = $1 LIMIT 1  [["id", 1]]