app/controllers/thing_images_controller.rb

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", 1]]
---
  def linkable_things
    authorize Thing, :get_linkables?
    image = Image.find(params[:image_id])

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "things".* FROM "things" WHERE "things"."id" = $1  ORDER BY "things"."id" ASC LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "thing_images" ("image_id", "thing_id", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["image_id", 1], ["thing_id", 1], ["creator_id", 1], ["created_at", "2019-07-28 23:22:31.445659"], ["updated_at", "2019-07-28 23:22:31.445659"]]
UPDATE "users" SET "tokens" = $1, "updated_at" = $2 WHERE "users"."id" = $3
---
  def create
    thing_image = ThingImage.new(thing_image_create_params.merge({
                                  :image_id=>params[:image_id],
                                  :thing_id=>params[:thing_id],
                                  }))
    thing=Thing.where(id:thing_image.thing_id).first
    if !thing
      full_message_error "cannot find thing[#{params[:thing_id]}]", :bad_request
      skip_authorization
    elsif !Image.where(id:thing_image.image_id).exists?
      full_message_error "cannot find image[#{params[:image_id]}]", :bad_request
      skip_authorization
    else
      authorize thing, :add_image?
      thing_image.creator_id=current_user.id
      if thing_image.save

UPDATE "thing_images" SET "priority" = $1, "updated_at" = $2 WHERE "thing_images"."id" = $3  [["priority", 0], ["updated_at", "2019-07-28 23:25:52.693496"], ["id", 1]]
---
  def update
    authorize @thing, :update_image?
    if @thing_image.update(thing_image_update_params)

UPDATE "images" SET "updated_at" = '2019-07-28 15:39:38.526814' WHERE "images"."id" = $1  [["id", 1]]
DELETE FROM "thing_images" WHERE "thing_images"."id" = $1  [["id", 1]]
---
  def destroy
    authorize @thing, :remove_image?
    @thing_image.image.touch #image will be only thing left
    @thing_image.destroy