app/controllers/types_controller.rb

    def index
      authorize Type
      types = policy_scope(Type.all)
---
SELECT "types".* FROM "types"

    def show
      # byebug
      authorize @type
      types = policy_scope(Type.where(:id=>@type.id))
---
SELECT  "types".* FROM "types" WHERE "types"."id" = $1 LIMIT 1  [["id", 5]]

    def create
      authorize Type
      @type = Type.new(type_params)
      @type.creator_id=current_user.id

      User.transaction do
        if @type.save
          role=current_user.add_role(Role::ORGANIZER,@type)
          @type.user_roles << role.role_name
          role.save!
---
INSERT INTO "types" ("label", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["label", "eeeee"], ["creator_id", 3], ["created_at", "2019-08-14 22:54:43.171869"], ["updated_at", "2019-08-14 22:54:43.171869"]]
INSERT INTO "roles" ("role_name", "mname", "mid", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["role_name", "organizer"], ["mname", "Type"], ["mid", 3], ["user_id", 3], ["created_at", "2019-08-14 22:54:43.191015"], ["updated_at", "2019-08-14 22:54:43.191015"]]
UPDATE "users" SET "tokens" = $1, "updated_at" = $2 WHERE "users"."id" = $3

    def destroy
      authorize @type
      @type.destroy
---
DELETE FROM "types" WHERE "types"."id" = $1  [["id", 13]]

      def set_type
        @type = Type.find(params[:id])
---
SELECT  "types".* FROM "types" WHERE "types"."id" = $1 LIMIT 1  [["id", 13]]